---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.StructuralAssetClass
source: html/3ecde669-5e9d-e4fd-5b19-c5605684bce1.htm
---
# Autodesk.Revit.DB.StructuralAsset.StructuralAssetClass Property

The type of material that this structural asset describes (e.g. wood, concrete, metal.)

## Syntax (C#)
```csharp
public StructuralAssetClass StructuralAssetClass { get; }
```